# IdeaStatiCa.RcsApi.Model.CrossSection
Cross-section

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** | Name of cross-section | [optional]
**CrossSectionRotation** | **double** | Rotation of Cross - Section | [optional]
**IsInPrincipal** | **bool** | Specifies that the cross-section is in its principal axis. | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)